{
  "backend/main.mo": "Motoko canister implementing user profiles and student signup storage with access‑controlled queries and mutations for users and admins.",
  "feature_evidence.json": "Feature evidence report mapping implemented app features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten short summaries for all frontend React source files.",
  "frontend/index.css": "Global Tailwind and CSS variables file defining the app’s OKLCH color palette and theme tokens for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, authentication guards, layout, theming, and global toasts.",
  "frontend/src/components/AppFooter.tsx": "Footer component showing copyright text and a caffeine.ai attribution link.",
  "frontend/src/components/AppHeader.tsx": "Responsive header with navigation links, mobile menu, logo, and authentication controls.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapper rendering the header, routed content, and footer.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied card with a message and link to home when user lacks permissions.",
  "frontend/src/components/auth/AuthControls.tsx": "Renders login/logout controls, showing sign-in button or account dropdown based on Internet Identity state.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to enter their name and save it via useSaveCallerUserProfile.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Wrapper that checks caller role and shows loading, access denied, or its children based on admin status.",
  "frontend/src/components/auth/RequireAuth.tsx": "Ensures user authentication via Internet Identity, showing loading or sign-in UI before rendering children.",
  "frontend/src/components/StudentSignupForm.tsx": "Signup form component using react-hook-form to submit student signup data via useCreateSignup with validation and success/error toasts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAdminSignups.ts": "Hooks for admins to fetch all student signups or a specific signup by ID using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login state, stored identities, and authentication helpers.",
  "frontend/src/hooks/useStudentSignups.ts": "Hooks to create a new signup and fetch the current user's signups via the actor.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to fetch and save the caller's user profile and retrieve their role using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying global border, background, and text styling.",
  "frontend/src/main.tsx": "Initializes React app with React Query and InternetIdentityProvider, rendering the root App component.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Displays all student registrations in a table with loading and error handling, linking to individual record details.",
  "frontend/src/pages/admin/AdminSignupDetailPage.tsx": "Shows detailed information for a single student signup with navigation back to the admin panel and error states.",
  "frontend/src/pages/LandingPage.tsx": "Implements the marketing landing page with hero section, feature cards, and navigation buttons for signup and admin access.",
  "frontend/src/pages/StudentProfilePage.tsx": "Fetches and displays the logged-in student's registration records with loading, error, and empty states.",
  "frontend/src/pages/StudentSignupPage.tsx": "Shows a student registration form and navigates to the profile page upon successful submission.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store/retrieve them in sessionStorage, and persist or clear them as needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, plugins, and container settings for the app’s theme.",
  "project_state.json": "Defines the project’s current state, features, requirements, and metadata for the Shikshy mantra app build."
}